#include <iostream>

const int N = 1000;

using namespace std;

//1. Згенерувати масив розмірності 1000 елеметтів:
//a.відсортований за зростанням;
//b.з випадковими елементами від 0 до 1000;
//c.відсортований за споданням.
//2. Для даних таблиці 5.2 реалізувати алгоритми сортування за зростанням,
//отримавши такі змінні :
//a.кількість порівнянь;
//10
//b.кількість обмінів.
//3. Результати експеременту представити у вигляді таблиці
//----------------------------Variant 4----------------------------------
//4. |Сортування вибором| |Метод Шелла|  |Метод Хоара|

void sortingBySelection()
{

}

void sortingByShellMethod()
{
	
}

void sortingByHoarrMethod()
{
	
}

void arrayFilling(int a[])
{
	int el = 0;

	for (int i = 0; i < N; i++)
	{
		a[i] = rand() % 120;
		el = i;
	}

	cout << endl << endl << el + 1 << endl;
}

int main()
{
	int array[N];
}